In [1]:
import pandas as pd

In [2]:
# Set countries_df index to country
countries_df = pd.DataFrame({
'country': ['United States', 'The Netherlands', 'Spain', 'Mexico', 'Australia'],
'capital': ['Washington D.C.', 'Amsterdam', 'Madrid', 'Mexico City', 'Canberra'],
'continent': ['North America', 'Europe', 'Europe', 'North America', 'Australia'],
'language': ['English', 'Dutch', 'Spanish', 'Spanish', 'English']})

countries_df = countries_df.set_index("country")
countries_df

                         capital      continent language
country
United States    Washington D.C.  North America  English
The Netherlands        Amsterdam         Europe    Dutch
Spain                     Madrid         Europe  Spanish
Mexico               Mexico City  North America  Spanish
Australia               Canberra      Australia  English

In [3]:
# Use loc and iloc "query" to get capital of Mexico
print(countries_df.loc["Mexico", "capital"])
countries_df.iloc[3, 0]

Mexico City

'Mexico City'

In [4]:
# Use loc and iloc "query" to get all languages
print(countries_df.loc[:, "language"])
countries_df.iloc[:, 2]

country
United States      English
The Netherlands      Dutch
Spain              Spanish
Mexico             Spanish
Australia          English
Name: language, dtype: object

country
United States      English
The Netherlands      Dutch
Spain              Spanish
Mexico             Spanish
Australia          English
Name: language, dtype: object

In [5]:
# Use loc and iloc "query" to get all data for Spain
print(countries_df.loc["Spain", :])
countries_df.iloc[2, :]

capital       Madrid
continent     Europe
language     Spanish
Name: Spain, dtype: object

capital       Madrid
continent     Europe
language     Spanish
Name: Spain, dtype: object

In [6]:
# How method columns works
banks_df = pd.read_csv("top100banks.csv", index_col="rank")
banks_df.columns

Index(['bank', 'country', 'total_assets_us_b', 'balance_sheet'], dtype='object')

In [7]:
# How columns names can be called (this is rarely used in practice if ever)
banks_df.bank

rank
1      Industrial & Commercial Bank of China
2               China Construction Bank Corp
3                 Agricultural Bank of China
4                              Bank of China
5             Mitsubishi UFJ Financial Group
                       ...
116                      Qatar National Bank
117                  National Bank of Canada
118                           Suntrust Banks
119                   Korea Development Bank
120                                  Belfius
Name: bank, Length: 120, dtype: object

In [8]:
# Calling multiple columns MUST be a list in a list
banks_df[["bank", "country", "total_assets_us_b"]]

                                       bank      country total_assets_us_b
rank
1     Industrial & Commercial Bank of China        China          4,005.58
2              China Construction Bank Corp        China          3,397.13
3                Agricultural Bank of China        China          3,232.68
4                             Bank of China        China          2,989.16
5            Mitsubishi UFJ Financial Group        Japan          2,773.82
...                                     ...          ...               ...
116                     Qatar National Bank        Qatar            221.18
117                 National Bank of Canada       Canada           208.408
118                          Suntrust Banks          USA           205.962
119                  Korea Development Bank  South Korea           205.145
120                                 Belfius      Belgium           201.192

[120 rows x 3 columns]

In [9]:
# Using slicing with loc 
banks_df.loc[1:5, "bank":"total_assets_us_b"]

                                       bank country total_assets_us_b
rank
1     Industrial & Commercial Bank of China   China          4,005.58
2              China Construction Bank Corp   China          3,397.13
3                Agricultural Bank of China   China          3,232.68
4                             Bank of China   China          2,989.16
5            Mitsubishi UFJ Financial Group   Japan          2,773.82

In [10]:
# Using slicing with iloc (iloc counts with index being 0)
banks_df.iloc[0:6, 0:3]

                                       bank country total_assets_us_b
rank
1     Industrial & Commercial Bank of China   China          4,005.58
2              China Construction Bank Corp   China          3,397.13
3                Agricultural Bank of China   China          3,232.68
4                             Bank of China   China          2,989.16
5            Mitsubishi UFJ Financial Group   Japan          2,773.82
6                       JPMorgan Chase & Co     USA          2,533.60

In [11]:
# Using list with loc
banks_df.loc[[1, 3, 10], "bank":"total_assets_us_b"]

                                       bank country total_assets_us_b
rank
1     Industrial & Commercial Bank of China   China          4,005.58
3                Agricultural Bank of China   China          3,232.68
10                   China Development Bank   China          2,201.86

In [12]:
# Using list with iloc
banks_df.iloc[[1, 3, 10], 0:3]

                              bank country total_assets_us_b
rank
2     China Construction Bank Corp   China          3,397.13
4                    Bank of China   China          2,989.16
11           Credit Agricole Group  France          2,112.04

In [13]:
# Dataframe vs. string outputs
print(type(banks_df.iloc[[2], [1]]))
banks_df.iloc[[2], [1]]

<class 'pandas.core.frame.DataFrame'>

     country
rank
3      China

In [14]:
print(type(banks_df.iloc[2,1]))
banks_df.iloc[2,1]

<class 'str'>

'China'

In [15]:
print(type(banks_df.loc[2, "bank"]))
banks_df.loc[2, "bank"]

<class 'str'>

'China Construction Bank Corp'

In [16]:
# alternative input using variables for better readability
rows = [1,2,3,4]
cols = ["bank", "total_assets_us_b"]
banks_df.loc[rows, cols]

                                       bank total_assets_us_b
rank
1     Industrial & Commercial Bank of China          4,005.58
2              China Construction Bank Corp          3,397.13
3                Agricultural Bank of China          3,232.68
4                             Bank of China          2,989.16